# Tabular data Pre-processing

- Structured data - Tabular data
- Semistructured data - Json data
- Unstructured data - Text file

## Data reading and setup

In [58]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder,StandardScaler

In [59]:
df_drones=pd.read_csv('data/drones.csv')
df_services=pd.read_csv('data/services.csv')
df_actuals=pd.read_csv('data/actuals.csv')
df_schedules=pd.read_csv('data/schedules.csv')
df_stations=pd.read_csv('data/stations.csv')

In [60]:
df_schedules.head()

,forecast_windspeed_kts,scheduled_arrival_datetime,scheduled_departure_datetime,service_id,station,station_call_id
0,4,2050-07-01 05:06,2050-07-01 06:00,JP_0,Iwade,JP_0_205007010506
1,7,2050-07-01 06:19,2050-07-01 07:00,JP_0,Komono,JP_0_205007010619
2,6,2050-07-01 07:09,2050-07-01 08:00,JP_0,Toba,JP_0_205007010709
3,8,2050-07-01 08:21,2050-07-01 09:00,JP_0,Gero,JP_0_205007010821
4,13,2050-07-01 09:09,2050-07-01 10:00,JP_0,Ina,JP_0_205007010909

In [61]:
df_actuals.head()

,actual_arrival_datetime,actual_departure_datetime,actual_fuel_consumption_gm_per_mile,actual_windspeed_kts,arrival_delay_seconds,service_id,station,station_call_id
0,2050-07-01 05:06,2050-07-01 06:00,56.12,0,2,JP_0,Iwade,JP_0_205007010506
1,2050-07-01 06:19,2050-07-01 07:00,168.31,0,5,JP_0,Komono,JP_0_205007010619
2,2050-07-01 07:09,2050-07-01 08:00,77.31,0,2,JP_0,Toba,JP_0_205007010709
3,2050-07-01 08:21,2050-07-01 09:00,164.24,0,6,JP_0,Gero,JP_0_205007010821
4,2050-07-01 09:09,2050-07-01 10:00,69.68,0,3,JP_0,Ina,JP_0_205007010909

In [62]:
df_drones.head()

,capacity_persons,drone_id,fuel_consumption_gm_per_mile,manufacturer,max_altitude_ft,max_capacity_fuel_gm,min_capacity_fuel_gm,operating_speed_mph,optimal_altitude_ft,service_id
0,114,971-LGB,1.87,Sharp Ltd,8000,3740,1,266,1000,JP_0
1,438,ZTG 357,5.10,Freeman-Garrison,7000,10200,1,216,1000,DZ_0
2,493,I55 1AC,0.79,Perez Inc,4000,1580,1,149,2000,DE_1
3,154,XUW-2971,2.84,Sharp Ltd,9000,2840,1,291,1000,US_0
4,59,564AL,0.76,Greene-Beasley,10000,1520,1,188,1000,JP_2

In [63]:
df_data = df_schedules.merge(df_drones,on='service_id')

In [64]:
df_data.head()

,forecast_windspeed_kts,scheduled_arrival_datetime,scheduled_departure_datetime,service_id,station,station_call_id,capacity_persons,drone_id,fuel_consumption_gm_per_mile,manufacturer,max_altitude_ft,max_capacity_fuel_gm,min_capacity_fuel_gm,operating_speed_mph,optimal_altitude_ft
0,4,2050-07-01 05:06,2050-07-01 06:00,JP_0,Iwade,JP_0_205007010506,114,971-LGB,1.87,Sharp Ltd,8000,3740,1,266,1000
1,7,2050-07-01 06:19,2050-07-01 07:00,JP_0,Komono,JP_0_205007010619,114,971-LGB,1.87,Sharp Ltd,8000,3740,1,266,1000
2,6,2050-07-01 07:09,2050-07-01 08:00,JP_0,Toba,JP_0_205007010709,114,971-LGB,1.87,Sharp Ltd,8000,3740,1,266,1000
3,8,2050-07-01 08:21,2050-07-01 09:00,JP_0,Gero,JP_0_205007010821,114,971-LGB,1.87,Sharp Ltd,8000,3740,1,266,1000
4,13,2050-07-01 09:09,2050-07-01 10:00,JP_0,Ina,JP_0_205007010909,114,971-LGB,1.87,Sharp Ltd,8000,3740,1,266,1000

In [65]:
clm_to_drop = ['scheduled_arrival_datetime','scheduled_departure_datetime','service_id','station','manufacturer','drone_id']

In [66]:
df_data.drop(columns=clm_to_drop,inplace=True)

In [67]:
df_data

,forecast_windspeed_kts,station_call_id,capacity_persons,fuel_consumption_gm_per_mile,max_altitude_ft,max_capacity_fuel_gm,min_capacity_fuel_gm,operating_speed_mph,optimal_altitude_ft
0,4,JP_0_205007010506,114,1.87,8000,3740,1,266,1000
1,7,JP_0_205007010619,114,1.87,8000,3740,1,266,1000
2,6,JP_0_205007010709,114,1.87,8000,3740,1,266,1000
3,8,JP_0_205007010821,114,1.87,8000,3740,1,266,1000
4,13,JP_0_205007010909,114,1.87,8000,3740,1,266,1000
...,...,...,...,...,...,...,...,...,...
12489,1,World_3_205007300754,1066,17.86,4000,17860,1,620,1000
12490,1,World_3_205007301936,1066,17.86,4000,17860,1,620,1000
12491,0,World_3_205007310454,1066,17.86,4000,17860,1,620,1000
12492,2,World_3_205007311854,1066,17.86,4000,17860,1,620,1000
12493,6,World_3_205008010636,1066,17.86,4000,17860,1,620,1000

In [68]:
traning_data = df_data.merge(df_actuals[['arrival_delay_seconds','station_call_id']],on='station_call_id')

In [69]:
test_data = df_data[~df_data['station_call_id'].isin(traning_data['station_call_id'].to_list())]

## Normalization

In [70]:
traning_data.drop(columns=['station_call_id'],inplace=True)
test_data.drop(columns=['station_call_id'],inplace=True)

/home/hitkul/anaconda3/envs/IGDTU_summer/lib/python3.8/site-packages/pandas/core/frame.py:3990: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [71]:
features = list(traning_data.columns)
features.remove('arrival_delay_seconds')

In [72]:
trainX,trainY = traning_data[features].values,traning_data['arrival_delay_seconds'].values
testX = test_data.values

In [73]:
trainX.shape,trainY.shape,testX.shape

((9924, 8), (9924,), (2570, 8))

In [74]:
scaler = StandardScaler()

In [75]:
scaler.fit(trainX)

StandardScaler()

In [76]:
trainX_norm = scaler.transform(trainX)
testX_norm = scaler.transform(testX)

In [81]:
trainX.max(),trainX.min(),trainX.mean()

(28280.0, 0.0, 2008.0340089681579)

In [82]:
trainX_norm.max(),trainX_norm.min(),trainX_norm.mean()

(6.617838095190163, -1.4182271125805397, -1.0023779021202541e-17)

## Label Encoding

In [83]:
df=pd.read_csv("data/Salary.csv")

In [84]:
df

  Country  Age  Salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000

In [85]:
df.info

<bound method DataFrame.info of   Country  Age  Salary
0   India   44   72000
1      US   34   65000
2   Japan   46   98000
3      US   35   45000
4   Japan   23   34000>

In [89]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()
df['Country']= label_encoder.fit_transform(df['Country']) 
print(df.head())

   Country  Age  Salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [91]:
from sklearn.preprocessing import OneHotEncoder
onehotencoder = OneHotEncoder()
X = onehotencoder.fit_transform(df.Country.values.reshape(-1,1)).toarray()
dfOneHot = pd.DataFrame(X, columns = ["Country_"+str(int(i)) for i in range(df.shape[1])]) 
df = pd.concat([df, dfOneHot], axis=1)
df=df.drop(['Country'], axis=1) 
df.head()

   Age  Salary  Country_0  Country_1  Country_2
0   44   72000        1.0        0.0        0.0
1   34   65000        0.0        0.0        1.0
2   46   98000        0.0        1.0        0.0
3   35   45000        0.0        0.0        1.0
4   23   34000        0.0        1.0        0.0

## Missing Values

In [92]:
dataset = pd.read_csv('data/pima-indians-diabetes.csv', header=None)

In [93]:
dataset.describe()

,0,1,2,3,4,5,6,7,8
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [94]:
num_missing = (dataset[[1,2,3,4,5]] == 0).sum()

In [95]:
num_missing

1      5
2     35
3    227
4    374
5     11
dtype: int64

In [97]:
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan)
dataset.isnull().sum()

0      0
1      5
2     35
3    227
4    374
5     11
6      0
7      0
8      0
dtype: int64

In [99]:
dataset.head()

   0      1     2     3      4     5      6   7  8
0  6  148.0  72.0  35.0    NaN  33.6  0.627  50  1
1  1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
2  8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
3  1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
4  0  137.0  40.0  35.0  168.0  43.1  2.288  33  1

### Remove rows

In [100]:
print(dataset.shape)
dataset.dropna(inplace=True)
print(dataset.shape)

(768, 9)
(392, 9)

### Replace missing value

Fill missing with mean

In [103]:
from sklearn.impute import SimpleImputer

In [108]:
dataset = pd.read_csv('data/pima-indians-diabetes.csv', header=None)
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan)
values = dataset.values
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
transformed_values = imputer.fit_transform(values)
print(f'Missing: {np.isnan(transformed_values).sum()}' )

Missing: 0

In [111]:
dataset.head()

   0      1     2     3      4     5      6   7  8
0  6  148.0  72.0  35.0    NaN  33.6  0.627  50  1
1  1   85.0  66.0  29.0    NaN  26.6  0.351  31  0
2  8  183.0  64.0   NaN    NaN  23.3  0.672  32  1
3  1   89.0  66.0  23.0   94.0  28.1  0.167  21  0
4  0  137.0  40.0  35.0  168.0  43.1  2.288  33  1

In [113]:
transformed_values

array([[  6.   , 148.   ,  72.   , ...,   0.627,  50.   ,   1.   ],
       [  1.   ,  85.   ,  66.   , ...,   0.351,  31.   ,   0.   ],
       [  8.   , 183.   ,  64.   , ...,   0.672,  32.   ,   1.   ],
       ...,
       [  5.   , 121.   ,  72.   , ...,   0.245,  30.   ,   0.   ],
       [  1.   , 126.   ,  60.   , ...,   0.349,  47.   ,   1.   ],
       [  1.   ,  93.   ,  70.   , ...,   0.315,  23.   ,   0.   ]])

In [114]:
dataset = pd.read_csv('data/pima-indians-diabetes.csv', header=None)
dataset[[1,2,3,4,5]] = dataset[[1,2,3,4,5]].replace(0, np.nan)
values = dataset.values
imputer = SimpleImputer(missing_values=np.nan, strategy='most_frequent')
transformed_values = imputer.fit_transform(values)
print(f'Missing: {np.isnan(transformed_values).sum()}')

Missing: 0

In [115]:
transformed_values

array([[  6.   , 148.   ,  72.   , ...,   0.627,  50.   ,   1.   ],
       [  1.   ,  85.   ,  66.   , ...,   0.351,  31.   ,   0.   ],
       [  8.   , 183.   ,  64.   , ...,   0.672,  32.   ,   1.   ],
       ...,
       [  5.   , 121.   ,  72.   , ...,   0.245,  30.   ,   0.   ],
       [  1.   , 126.   ,  60.   , ...,   0.349,  47.   ,   1.   ],
       [  1.   ,  93.   ,  70.   , ...,   0.315,  23.   ,   0.   ]])

## Class Imbalance -  SMOTE

In [118]:
from collections import Counter
from sklearn.datasets import make_classification
from imblearn.over_sampling import SMOTE # doctest: +NORMALIZE_WHITESPACE

In [119]:
X, y = make_classification(n_classes=2, class_sep=2,
weights=[0.1, 0.9], n_informative=3, n_redundant=1, flip_y=0,
n_features=20, n_clusters_per_class=1, n_samples=1000, random_state=10)

In [120]:
print('Original dataset shape %s' % Counter(y))

Original dataset shape Counter({1: 900, 0: 100})

In [121]:
sm = SMOTE(random_state=42)

In [122]:
X_res, y_res = sm.fit_resample(X, y)

In [123]:
print('Resampled dataset shape %s' % Counter(y_res))

Resampled dataset shape Counter({0: 900, 1: 900})